{
  "items": [
    {
      "id": 1,
      "name": "Битва при Маренго",
      "year": 1800,
      "description": "Битва при Маренго произошла в тысяча восемьсотом году, где мой корпус столкнулся с армией австрийского генерала Меласа. На полях Маренго, узких и покрытых пылью, мы вели ожесточенный бой. Французские гренадеры сражались плечом к плечу, пока огонь не сделал их кровавыми тенями на поле битвы. Артиллерия раскатывала свои ужасающие громовые песни, разрывая ряды противника. Несмотря на численное превосходство австрийцев, наши войска блестяще использовали тактику маневра и контратаки. Под моим руководством наши отряды разрушили линию противника, вынуждая их отступить. Битва при Маренго стала вехой в истории военного искусства, подтверждением моей неоспоримой гениальности в тактике и стратегии."
    },
    {
      "id": 2,
      "name": "Трафальгарское сражение",
      "year": 1805,
      "description": "Я вспоминаю Трафальгарское сражение с жалостью в сердце. Это был 1805 год, когда моя великая армия столкнулась с флотом адмирала Нельсона. Туманным утром, под голубым небом, французские и испанские корабли вступили в смертельный танец с английским флотом. Шум морского прибоя смешивался с ревом орудий, а паруса трещали под ударами ветра и ядер.Адмирал Нельсон, хитрый и опытный воин, расположил свои суда в стройную линию, умело используя ветер и огонь. Несмотря на мужество и отвагу моих моряков, численное превосходство англичан и их ловкие тактические ходы принесли им победу. Многие наши корабли были поверженыНесмотря на этот удар, великая Франция продолжила свой путь к величию. Это сражение стало напоминанием о том, что путь к победе часто тернист и требует постоянной борьбы ",
      "images": ["/img/Crowned.jpeg", "/img/Crowned.jpeg", "/img/Crowned.jpeg"]
    },
    {
      "id": 3,
      "name": "Битва прии Аустерлице",
      "year": 1805,
      "description": "Item 1 description"
    },
    {
      "id": 4,
      "name": "Битва при Йене",
      "year": 1806,
      "description": "Item 1 description"
    },
    {
      "id": 5,
      "name": "Оккупация Испании",
      "year": 1808,
      "description": "Item 1 description"
    },
    {
      "id": 6,
      "name": "Битва при Лейпциге",
      "year": 1814,
      "description": "Item 1 description"
    },
    {
      "id": 7,
      "name": "Бородинское сражение",
      "year": 1812,
      "description": "Item 1 description"
    },
    {
      "id": 8,
      "name": "Битва при Ватерлоо",
      "year": 1815,
      "description": "Item 1 description"
    },
    {
      "id": 9,
      "name": "Item 1",
      "year": 1800,
      "description": "Item 1 description"
    },
    {
      "id": 10,
      "name": "Item 1",
      "year": 1800,
      "description": "Item 1 description"
    }
  ]
}
